cases/branch_d/c3_curved_openmc_ffhr_be_stack_depth_mapped_cht/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
vertices
(
    (0 -0.008 0.015)
    (0 -0.008 -0.015)
    (0 0.008 -0.015)
    (0 0.008 0.015)
    (0 -0.008 0.019)
    (0 0.008 0.019)
    (0.01139011604 -0.005411809549 0.01539360506)
    (0.01346104623 -0.005411809549 -0.01453483039)
    (0.01346104623 0.01058819045 -0.01453483039)
    (0.01139011604 0.01058819045 0.01539360506)
    (0.01111399202 -0.005411809549 0.01938406311)
    (0.01111399202 0.01058819045 0.01938406311)
    (0.02272589018 -0.003 0.01657254234)
    (0.02685787021 -0.003 -0.01314154087)
    (0.02685787021 0.013 -0.01314154087)
    (0.02272589018 0.013 0.01657254234)
    (0.02217495951 -0.003 0.02053442011)
    (0.02217495951 0.013 0.02053442011)
    (0.03395323976 -0.0009289321881 0.01853118719)
    (0.04012655608 -0.0009289321881 -0.01082677877)
    (0.04012655608 0.01507106781 -0.01082677877)
    (0.03395323976 0.01507106781 0.01853118719)
    (0.03313013092 -0.0009289321881 0.02244558265)
    (0.03313013092 0.01507106781 0.02244558265)
    (0.04501859945 0.0006602540378 0.02126019496)
    (0.05320379935 0.0006602540378 -0.007601587772)
    (0.05320379935 0.01666025404 -0.007601587772)
    (0.04501859945 0.01666025404 0.02126019496)
    (0.04392723946 0.0006602540378 0.02510843266)
    (0.04392723946 0.01666025404 0.02510843266)
    (0.05586917673 0.001659258263 0.02474654564)
    (0.06602720886 0.001659258263 -0.003481355155)
    (0.06602720886 0.01765925826 -0.003481355155)
    (0.05586917673 0.01765925826 0.02474654564)
    (0.05451477245 0.001659258263 0.02851026574)
    (0.05451477245 0.01765925826 0.02851026574)
    (0.06645320383 0.002 0.02897360595)
    (0.07853560452 0.002 0.001514261572)
    (0.07853560452 0.018 0.001514261572)
    (0.06645320383 0.018 0.02897360595)
    (0.06484221707 0.002 0.03263485186)
    (0.06484221707 0.018 0.03263485186)
    (0.07672018465 0.001659258263 0.0339212087)
    (0.09066930914 0.001659258263 0.007361428468)
    (0.09066930914 0.01765925826 0.007361428468)
    (0.07672018465 0.01765925826 0.0339212087)
    (0.07486030139 0.001659258263 0.03746251274)
    (0.07486030139 0.01765925826 0.03746251274)
    (0.08662113576 0.0006602540378 0.03956574905)
    (0.1023704332 0.0006602540378 0.01403224887)
    (0.1023704332 0.01666025404 0.01403224887)
    (0.08662113576 0.01666025404 0.03956574905)
    (0.08452122943 0.0006602540378 0.04297021574)
    (0.08452122943 0.01666025404 0.04297021574)
    (0.09610881998 -0.0009289321881 0.04588029704)
    (0.1135831509 -0.0009289321881 0.0214948965)
    (0.1135831509 0.01507106781 0.0214948965)
    (0.09610881998 0.01507106781 0.04588029704)
    (0.0937789092 -0.0009289321881 0.04913168378)
    (0.0937789092 0.01507106781 0.04913168378)
    (0.1051379719 -0.003 0.05283472617)
    (0.1242539668 -0.003 0.02971376729)
    (0.1242539668 0.013 0.02971376729)
    (0.1051379719 0.013 0.05283472617)
    (0.1025891726 -0.003 0.05591752068)
    (0.1025891726 0.013 0.05591752068)
    (0.1136655136 -0.005411809549 0.06039585704)
    (0.1343319706 -0.005411809549 0.03864964923)
    (0.1343319706 0.01058819045 0.03864964923)
    (0.1136655136 0.01058819045 0.06039585704)
    (0.110909986 -0.005411809549 0.06329535142)
    (0.110909986 0.01058819045 0.06329535142)
    (0.1216507606 -0.008 0.06852761574)
    (0.1437690807 -0.008 0.04825990951)
    (0.1437690807 0.008 0.04825990951)
    (0.1216507606 0.008 0.06852761574)
    (0.1187016512 -0.008 0.07122997657)
    (0.1187016512 0.008 0.07122997657)
    (0.1290556153 -0.01058819045 0.07719120589)
    (0.1525202727 -0.01058819045 0.05849869787)
    (0.1525202727 0.005411809549 0.05849869787)
    (0.1290556153 0.005411809549 0.07719120589)
    (0.1259269944 -0.01058819045 0.07968354029)
    (0.1259269944 0.005411809549 0.07968354029)
    (0.1358447496 -0.013 0.08634529374)
    (0.160543795 -0.013 0.06931716533)
    (0.160543795 0.003 0.06931716533)
    (0.1358447496 0.003 0.08634529374)
    (0.1325515436 -0.013 0.08861571086)
    (0.1325515436 0.003 0.08861571086)
    (0.1419857726 -0.01507106781 0.09594620542)
    (0.1678013676 -0.01507106781 0.08066369732)
    (0.1678013676 0.0009289321881 0.08066369732)
    (0.1419857726 0.0009289321881 0.09594620542)
    (0.1385436933 -0.01507106781 0.09798387317)
    (0.1385436933 0.0009289321881 0.09798387317)
    (0.1474493857 -0.01666025404 0.1059481353)
    (0.1742583649 -0.01666025404 0.09248415986)
    (0.1742583649 -0.0006602540378 0.09248415986)
    (0.1474493857 -0.0006602540378 0.1059481353)
    (0.1438748551 -0.01666025404 0.107743332)
    (0.1438748551 -0.0006602540378 0.107743332)
    (0.1522095221 -0.01765925826 0.1163033644)
    (0.1798839806 -0.01765925826 0.1047221579)
    (0.1798839806 -0.001659258263 0.1047221579)
    (0.1522095221 -0.001659258263 0.1163033644)
    (0.1485195943 -0.01765925826 0.1178475252)
    (0.1485195943 -0.001659258263 0.1178475252)
    (0.1562434714 -0.018 0.1269624882)
    (0.1846513753 -0.018 0.1173193043)
    (0.1846513753 -0.002 0.1173193043)
    (0.1562434714 -0.002 0.1269624882)
    (0.1524557508 -0.018 0.1282482461)
    (0.1524557508 -0.002 0.1282482461)
    (0.1595319877 -0.01765925826 0.1378746525)
    (0.1885378036 -0.01765925826 0.1302154984)
    (0.1885378036 -0.001659258263 0.1302154984)
    (0.1595319877 -0.001659258263 0.1378746525)
    (0.1556645456 -0.01765925826 0.138895873)
    (0.1556645456 -0.001659258263 0.138895873)
    (0.1620593816 -0.01666025404 0.1489877955)
    (0.1915247237 -0.01666025404 0.1433492129)
    (0.1915247237 -0.0006602540378 0.1433492129)
    (0.1620593816 -0.0006602540378 0.1489877955)
    (0.1581306693 -0.01666025404 0.1497396065)
    (0.1581306693 -0.0006602540378 0.1497396065)
    (0.1638135951 -0.01507106781 0.1602488969)
    (0.1935978851 -0.01507106781 0.1566577872)
    (0.1935978851 0.0009289321881 0.1566577872)
    (0.1638135951 0.0009289321881 0.1602488969)
    (0.1598423564 -0.01507106781 0.1607277115)
    (0.1598423564 0.0009289321881 0.1607277115)
    (0.1647862587 -0.013 0.1716042302)
    (0.1947473966 -0.013 0.1700777265)
    (0.1947473966 0.003 0.1700777265)
    (0.1647862587 0.003 0.1716042302)
    (0.1607914403 -0.013 0.171807764)
    (0.1607914403 0.003 0.171807764)
    (0.1649727319 -0.01058819045 0.1829996194)
    (0.1949677741 -0.01058819045 0.1835450047)
    (0.1949677741 0.005411809549 0.1835450047)
    (0.1649727319 0.005411809549 0.1829996194)
    (0.160973393 -0.01058819045 0.1829269014)
    (0.160973393 0.005411809549 0.1829269014)
    (0.1643721252 -0.008 0.1943806976)
    (0.1942579661 -0.008 0.1969953698)
    (0.1942579661 0.008 0.1969953698)
    (0.1643721252 0.008 0.1943806976)
    (0.1603873464 -0.008 0.1940320746)
    (0.1603873464 0.008 0.1940320746)
);
blocks
(
    hex (0 6 9 3 4 10 11 5) (4 8 8) simpleGrading (1 1 1)
    hex (6 12 15 9 10 16 17 11) (4 8 8) simpleGrading (1 1 1)
    hex (12 18 21 15 16 22 23 17) (4 8 8) simpleGrading (1 1 1)
    hex (18 24 27 21 22 28 29 23) (4 8 8) simpleGrading (1 1 1)
    hex (24 30 33 27 28 34 35 29) (4 8 8) simpleGrading (1 1 1)
    hex (30 36 39 33 34 40 41 35) (4 8 8) simpleGrading (1 1 1)
    hex (36 42 45 39 40 46 47 41) (4 8 8) simpleGrading (1 1 1)
    hex (42 48 51 45 46 52 53 47) (4 8 8) simpleGrading (1 1 1)
    hex (48 54 57 51 52 58 59 53) (4 8 8) simpleGrading (1 1 1)
    hex (54 60 63 57 58 64 65 59) (4 8 8) simpleGrading (1 1 1)
    hex (60 66 69 63 64 70 71 65) (4 8 8) simpleGrading (1 1 1)
    hex (66 72 75 69 70 76 77 71) (4 8 8) simpleGrading (1 1 1)
    hex (72 78 81 75 76 82 83 77) (4 8 8) simpleGrading (1 1 1)
    hex (78 84 87 81 82 88 89 83) (4 8 8) simpleGrading (1 1 1)
    hex (84 90 93 87 88 94 95 89) (4 8 8) simpleGrading (1 1 1)
    hex (90 96 99 93 94 100 101 95) (4 8 8) simpleGrading (1 1 1)
    hex (96 102 105 99 100 106 107 101) (4 8 8) simpleGrading (1 1 1)
    hex (102 108 111 105 106 112 113 107) (4 8 8) simpleGrading (1 1 1)
    hex (108 114 117 111 112 118 119 113) (4 8 8) simpleGrading (1 1 1)
    hex (114 120 123 117 118 124 125 119) (4 8 8) simpleGrading (1 1 1)
    hex (120 126 129 123 124 130 131 125) (4 8 8) simpleGrading (1 1 1)
    hex (126 132 135 129 130 136 137 131) (4 8 8) simpleGrading (1 1 1)
    hex (132 138 141 135 136 142 143 137) (4 8 8) simpleGrading (1 1 1)
    hex (138 144 147 141 142 148 149 143) (4 8 8) simpleGrading (1 1 1)
    hex (1 7 8 2 0 6 9 3) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (7 13 14 8 6 12 15 9) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (13 19 20 14 12 18 21 15) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (19 25 26 20 18 24 27 21) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (25 31 32 26 24 30 33 27) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (31 37 38 32 30 36 39 33) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (37 43 44 38 36 42 45 39) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (43 49 50 44 42 48 51 45) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (49 55 56 50 48 54 57 51) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (55 61 62 56 54 60 63 57) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (61 67 68 62 60 66 69 63) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (67 73 74 68 66 72 75 69) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (73 79 80 74 72 78 81 75) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (79 85 86 80 78 84 87 81) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (85 91 92 86 84 90 93 87) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (91 97 98 92 90 96 99 93) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (97 103 104 98 96 102 105 99) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (103 109 110 104 102 108 111 105) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (109 115 116 110 108 114 117 111) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (115 121 122 116 114 120 123 117) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (121 127 128 122 120 126 129 123) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (127 133 134 128 126 132 135 129) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (133 139 140 134 132 138 141 135) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (139 145 146 140 138 144 147 141) (4 8 50) simpleGrading (1 1 0.021725732)
);
edges ();
boundary
(
    inlet
    {
        type patch;
        faces ((1 2 3 0));
    }
    outlet
    {
        type patch;
        faces ((145 144 147 146));
    }
    blanket_back_wall
    {
        type wall;
        faces
        (
        (1 7 8 2)
        (7 13 14 8)
        (13 19 20 14)
        (19 25 26 20)
        (25 31 32 26)
        (31 37 38 32)
        (37 43 44 38)
        (43 49 50 44)
        (49 55 56 50)
        (55 61 62 56)
        (61 67 68 62)
        (67 73 74 68)
        (73 79 80 74)
        (79 85 86 80)
        (85 91 92 86)
        (91 97 98 92)
        (97 103 104 98)
        (103 109 110 104)
        (109 115 116 110)
        (115 121 122 116)
        (121 127 128 122)
        (127 133 134 128)
        (133 139 140 134)
        (139 145 146 140)
        );
    }
    side_walls
    {
        type wall;
        faces
        (
        (1 0 6 7)
        (2 8 9 3)
        (7 6 12 13)
        (8 14 15 9)
        (13 12 18 19)
        (14 20 21 15)
        (19 18 24 25)
        (20 26 27 21)
        (25 24 30 31)
        (26 32 33 27)
        (31 30 36 37)
        (32 38 39 33)
        (37 36 42 43)
        (38 44 45 39)
        (43 42 48 49)
        (44 50 51 45)
        (49 48 54 55)
        (50 56 57 51)
        (55 54 60 61)
        (56 62 63 57)
        (61 60 66 67)
        (62 68 69 63)
        (67 66 72 73)
        (68 74 75 69)
        (73 72 78 79)
        (74 80 81 75)
        (79 78 84 85)
        (80 86 87 81)
        (85 84 90 91)
        (86 92 93 87)
        (91 90 96 97)
        (92 98 99 93)
        (97 96 102 103)
        (98 104 105 99)
        (103 102 108 109)
        (104 110 111 105)
        (109 108 114 115)
        (110 116 117 111)
        (115 114 120 121)
        (116 122 123 117)
        (121 120 126 127)
        (122 128 129 123)
        (127 126 132 133)
        (128 134 135 129)
        (133 132 138 139)
        (134 140 141 135)
        (139 138 144 145)
        (140 146 147 141)
        );
    }
    heatedBase
    {
        type wall;
        faces
        (
        (4 5 11 10)
        (10 11 17 16)
        (16 17 23 22)
        (22 23 29 28)
        (28 29 35 34)
        (34 35 41 40)
        (40 41 47 46)
        (46 47 53 52)
        (52 53 59 58)
        (58 59 65 64)
        (64 65 71 70)
        (70 71 77 76)
        (76 77 83 82)
        (82 83 89 88)
        (88 89 95 94)
        (94 95 101 100)
        (100 101 107 106)
        (106 107 113 112)
        (112 113 119 118)
        (118 119 125 124)
        (124 125 131 130)
        (130 131 137 136)
        (136 137 143 142)
        (142 143 149 148)
        );
    }
    solidSides
    {
        type wall;
        faces
        (
        (0 4 10 6)
        (3 9 11 5)
        (6 10 16 12)
        (9 15 17 11)
        (12 16 22 18)
        (15 21 23 17)
        (18 22 28 24)
        (21 27 29 23)
        (24 28 34 30)
        (27 33 35 29)
        (30 34 40 36)
        (33 39 41 35)
        (36 40 46 42)
        (39 45 47 41)
        (42 46 52 48)
        (45 51 53 47)
        (48 52 58 54)
        (51 57 59 53)
        (54 58 64 60)
        (57 63 65 59)
        (60 64 70 66)
        (63 69 71 65)
        (66 70 76 72)
        (69 75 77 71)
        (72 76 82 78)
        (75 81 83 77)
        (78 82 88 84)
        (81 87 89 83)
        (84 88 94 90)
        (87 93 95 89)
        (90 94 100 96)
        (93 99 101 95)
        (96 100 106 102)
        (99 105 107 101)
        (102 106 112 108)
        (105 111 113 107)
        (108 112 118 114)
        (111 117 119 113)
        (114 118 124 120)
        (117 123 125 119)
        (120 124 130 126)
        (123 129 131 125)
        (126 130 136 132)
        (129 135 137 131)
        (132 136 142 138)
        (135 141 143 137)
        (138 142 148 144)
        (141 147 149 143)
        (0 3 5 4)
        (144 148 149 147)
        );
    }
);
mergePatchPairs ();
