cases/branch_d/c3_curved_openmc_ffhr_be_stack_depth_mapped_cht/constant/regionProperties
FoamFile { version 2.0; format ascii; class dictionary; object regionProperties; }
regions
(
    fluid       (bottomWater)
    solid       (heater)
);
