cases/branch_d/c3_curved_openmc_ffhr_be_stack_depth_mapped_cht/0/bottomWater/p
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 1e5;
boundaryField { ".*" { type calculated; value uniform 1e5; } }
